# 1--------------------------------------------------------------------------------------------------------
ids = {
    "user1": [213, 213, 213, 15, 213],
    "user2": [54, 54, 119, 119, 119],
    "user3": [213, 98, 98, 35],
}


def task_1(ids: dict):
    unique_values = []
    for i in ids.values():
        unique_values.extend(i)

    return print(set(unique_values))


# task_1(ids)
# 2--------------------------------------------------------------------------------------------------------
queries = [
    "смотреть сериалы онлайн",
    "новости спорта",
    "афиша кино",
    "курс доллара",
    "сериалы этим летом",
    "курс по питону",
    "сериалы про спорт",
]


def task_2(queries: list):
    num_words = [len(i.split()) for i in queries]
    unique_values = list(set(num_words))
    for j in unique_values:
        print(
            f"Поисковых запросов, содержащих {j} слов(а): {round((num_words.count(j) / len(num_words)) * 100, 2)}%"
        )


# task_2(queries)
# 3--------------------------------------------------------------------------------------------------------
